Terraform plan for __staging__
<details>
  <summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudfoundry_service_instance.k8s_cluster will be created
  + resource "cloudfoundry_service_instance" "k8s_cluster" {
      + id                             = (known after apply)
      + json_params                    = jsonencode(
            {
              + subdomain = "k8s-brokered"
            }
        )
      + name                           = "ssb-solr-k8s"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "75ff550a-1f72-4bc2-9bd9-644a174a3384"
      + space                          = "5edc803e-3376-4788-b72c-a152f11925b0"
      + tags                           = [
          + "k8s",
        ]

      + timeouts {
          + create = "40m"
          + delete = "30m"
          + update = "90m"
        }
    }

  # module.broker_solr.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "ee3956f0-aab7-476e-b556-6013cf5e164f"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solr"
      ~ source_code_hash           = "4zPyUddjS0HqAuptRu2PLMJIkaCjdPaaxMZgueWZsbQ=" -> "Pm7XppCHsmPfIRIydJtvESofhyObkEfv1u+IA7pVYP4="
        # (18 unchanged attributes hidden)


      + service_binding {
          + service_instance = (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

Plan generated in [plan #104](https://github.com/GSA/datagov-ssb/actions/runs/1046417130)